Revit 2027 API
Application.NewPointOnFace Method
Construct a PointOnFace object which is used to define the placement of a ReferencePoint given a reference and a location on the face.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointOnFace NewPointOnFace(
	Reference faceReference,
	UV uv
)
Public Function NewPointOnFace (
	faceReference As Reference,
	uv As UV
) As PointOnFace
public:
PointOnFace^ NewPointOnFace(
	Reference^ faceReference,
	UV^ uv
)
member NewPointOnFace :
        faceReference : Reference *
        uv : UV -> PointOnFace
Parameters
faceReference Reference
The reference whose face the object will be created on.
uv UV
A 2-dimensional position.
Return Value
PointOnFace
A new PointOnFace object.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument faceReference or uv is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace